[
  {
    "ButtonTitle": "BBVA Perú",
    "MainTitle": "Front-End Engineer / Release Manager",
    "Company": "BBVA",
    "RangeDate": "May 2023 - Present",
    "Items": [
      "Review integration flow for new releases", "Evaluate new features and ensure compliance with best practices","Lead Glopilot initiative, architecting both VS Code and Chrome extensions to streamline development workflow through custom AI agents and GitHub Copilot integration, significantly improving team productivity",
      "Authored development standards documentation for Lit Element, focusing on rendering optimization and BBVA Design System best practices",
      "Reviewed PRs for new feature integration into GloMo BBVA application","Developed accessible components meeting global accessibility standards, including talkback and Voice Over compatibility"
,"Created unit tests and E2E tests for web and mobile platforms"
    ],
    "Stack": [
      "LitElement",
      "Javascript",
      "Typescript",
      "HTMl",
      "Scss",
      "Polymer",
      "Vscode Extension",
      "Chrome Extension",
      "Websockets",
      "Fastify",
      "Karma",
      "Radish",
      "Android",
      "iOS",
      "Bitbucket"
    ],
    "Description": "Build & scale BBVA’s frontend platform (React, LitElement/Cells), set a11y/performance standards, integrate bank-grade APIs, and mentor teams. Led “Glopilot” to automate workflows, cutting repetitive work ~35%."
  },
  {
    "ButtonTitle": "Banco Pichincha - Devsu",
    "Company": "Banco Pichincha (through Devsu)",
    "MainTitle": "Full Stack Developer",
    "RangeDate": "March 2022 - May 2023",
    "Items": [
      "Development of process automation through robots focused on Uipath, Power Apps and Power Automate.",
      "Successful development of a cognitive assistant for process improvement of collaborators with Azure services (Bot service, Bot framework composer and LUIS) and integrating this service to microsoft teams.",
      "Development of NodeJs archetype with NestJs framework for internal use of the backend chapter of the client's company."
    ],
    "Description": "Full Stack Developer at Banco Pichincha via Devsu, specializing in RPA with UiPath, Power Apps, and Power Automate. Developed cognitive assistants using Azure Bot Services and LUIS, enhancing team efficiency through Microsoft Teams integration. Created Node.js archetypes with NestJS for backend solutions.",
    "Stack": [
      "UiPath",
      "Power Automate",
      "Power Apps",
      "NodeJs",
      "NestJs",
      "Azure",
      "Bot Service",
      "Bot Framework Composer",
      "LUIS",
      "Microsoft Teams"
    ]
  },
  {
    "ButtonTitle": "Distribuidora Inka",
    "Company": "Distribuidora Inka",
    "MainTitle": "IT-Support & Web Developer",
    "RangeDate": "December 2020 - December 2021",
    "Items": [
      "Management of servers with Windows Server 2012R2 and 2016 operating system.",
      "Implementation of business card generator (https://www.disdroinka.com/tarjeta) and signatures for business mail (https://www.disdroinka.com/firma-oficial).",
      "Development of a system for tracking vendors in real time (NextJs - React Native).",
      "Development of a landing page with NextJs and Firebase"
    ],
    "Description": "IT-Support and Web Developer at Distribuidora Inka, managing Windows Server environments and implementing digital solutions. Developed a business card generator and email signature system, enhancing brand consistency. Created a real-time vendor tracking system using Next.js and React Native, and built a landing page with Next.js and Firebase to boost online presence.",
    "Stack": ["NextJs", "ReactJs", "NodeJs", "MongoDB", "ExpressJs", "Git"]
  },
  {
    "ButtonTitle": "VascoTechnologies",
    "MainTitle": "System Intern",
    "Company": "VascoTechnologies",
    "RangeDate": "March - June 2021",
    "Items": [
      "Migration of e-commerce to wordpress and product quoting application, using automatic pdf generators and email alerts for analytics.",
      "Creation of custom plugins for payment methods (Yape, Plin and Tunki).",
      "Quick learning of the necessary tools to cover the solution (Wordpress and PHP)."
    ],
    "Description": "System Intern at VascoTechnologies, where I led the migration of e-commerce platforms to WordPress, enhancing user experience and operational efficiency. Developed a product quoting application featuring automatic PDF generation and email alerts for improved analytics. Created custom payment method plugins for Yape, Plin, and Tunki, demonstrating adaptability and quick learning of WordPress and PHP technologies.",
    "Stack": ["Wordpress", "PHP", "MySQL"]
  }
]
